# MEPAnalyticalSegment Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPAnalyticalSegment Members
MEPAnalyticalSegment Class Methods Properties See Also
---
The MEPAnalyticalSegment type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the MEPAnalyticalSegment |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Area | The area of the segment profile. |
| DemandFlow | The designed flow value, in ft^3/s. |
| DomainType | The connector domain type of this segment. |
| EndNode | The id of the end analytical node. |
| Id | The identity of this segment. |
| InnerDiameter | The inner diameter of this segment, in ft. For rectangular or oval profile, this may be the hydraulic diameter. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| RevitElementId | The id of the owning Revit element. |
| Roughness | The roughness of this segment, in ft. |
| SegmentType | The analytical segment type. |
| StartNode | The id of the start analytical node. |

# See Also
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace